paypal-backend/app/controllers/passwords_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test2@email.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$GvmkHrk/axFw6J7gkFELV.DfTaExsi4DhrAhaO1.aEHkpmFPvMbE2"], ["updated_at", "2020-03-16 02:26:38.709645"], ["id", 2]]
---
    def forgot
        if params[:email].blank? # check if email is present
         render json: {error: "Email not present"}
        end

        @user = User.find_by(email: params[:email]) # if present find user by email

        if @user.present?
          # evito correo solo mando un alert
          @user.password = 'recordado'
          @user.save